---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WiringType
source: html/fb484864-f9d0-7335-1f91-d7ac587f15fb.htm
---
# Autodesk.Revit.DB.Electrical.WiringType

An enumerated type to list all wiring types.

## Syntax (C#)
```csharp
public enum WiringType
```